app/views/customers/projects.html.erb


  <% @customer.projects.each do |project| %>
---
SELECT "projects".* FROM "projects" WHERE "projects"."customer_id" = $1  [["customer_id", 20]]