app/views/customers/show.html.erb

SELECT "coworkers".* FROM "coworkers" WHERE "coworkers"."customer_id" = $1  [["customer_id", 22]]
---
<h2>Coworkers</h2>
<% @customer.coworkers.each do |coworker| %>