app/views/projects/_form.html.erb

SELECT "customers".* FROM "customers"
---
    <p>
      <%= collection_select(:project, :customer_id, Customer.all, :id, :name) %>