app/views/coworkers/_coworker.html.erb


<% @customer.coworkers.each do |coworker| %>
---
SELECT "coworkers".* FROM "coworkers" WHERE "coworkers"."customer_id" = $1  [["customer_id", 22]]