app/controllers/coworkers_controller.rb

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
---
  def new
    @customer = Customer.find(params[:customer_id])

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]
INSERT INTO "coworkers" ("coworker_name", "coworker_position", "coworker_phone", "coworker_skype", "coworker_email", "customer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @customer = Customer.find(params[:customer_id])
    @coworker = @customer.coworkers.create(coworker_params)

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
SELECT  "coworkers".* FROM "coworkers" WHERE "coworkers"."customer_id" = $1 AND "coworkers"."id" = $2 LIMIT $3  [["customer_id", 24], ["id", 15], ["LIMIT", 1]]
DELETE FROM "coworkers" WHERE "coworkers"."id" = $1  [["id", 15]]
---
  def destroy
    @customer = Customer.find(params[:customer_id])
    @coworker = @customer.coworkers.find(params[:id])
    @coworker.destroy