app/controllers/customers_controller.rb

  def show
    @customer = Customer.find(params[:id])
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def projects
    @customer = Customer.find(params[:id])
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]

  def edit
    @customer = Customer.find(params[:id])
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @customer = Customer.create(customer_params).save
---
INSERT INTO "customers" ("created_at", "updated_at", "name") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2017-05-22 09:28:15.125524"], ["updated_at", "2017-05-22 09:28:15.125524"], ["name", "awgeaewga"]]

  def update
    @customer = Customer.find(params[:id])
    if @customer.update(customer_params)
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "customers" SET "name" = $1, "updated_at" = $2 WHERE "customers"."id" = $3  [["name", "2x2"], ["updated_at", "2017-05-22 14:27:09.105853"], ["id", 4]]

  def destroy
    @customer = Customer.find(params[:id])
    @customer.destroy
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "customers" WHERE "customers"."id" = $1  [["id", 1]]