app/controllers/mytasks_controller.rb

  def index
    @mytask = Mytask.all
---
SELECT "mytasks".* FROM "mytasks"

  def show
    @mytask = Mytask.find(params[:id])
---
SELECT  "mytasks".* FROM "mytasks" WHERE "mytasks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def edit
    @mytask = Mytask.find(params[:id])
---
SELECT  "mytasks".* FROM "mytasks" WHERE "mytasks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

  def create
    @mytask = Mytask.create(mytasks_params).save
---
INSERT INTO "mytasks" ("taskname", "taskcontent", "created_at", "updated_at", "taskstatus", "createtask", "endtask") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["taskname", ""], ["taskcontent", ""], ["created_at", "2017-05-31 11:14:08.067886"], ["updated_at", "2017-05-31 11:14:08.067886"], ["taskstatus", ""], ["createtask", ""], ["endtask", ""]]

  def update
    @mytask = Mytask.find(params[:id])
    if @mytask.update(mytasks_params)
---
SELECT  "mytasks".* FROM "mytasks" WHERE "mytasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "mytasks" SET "taskname" = $1, "taskcontent" = $2, "updated_at" = $3 WHERE "mytasks"."id" = $4  [["taskname", "Create ticket"], ["taskcontent", "Create and execute checklist for mobile app and website"], ["updated_at", "2017-06-07 12:18:45.233617"], ["id", 7]]

  def destroy
    @mytask = Mytask.find(params[:id]).destroy
---
DELETE FROM "mytasks" WHERE "mytasks"."id" = $1  [["id", 5]]
SELECT  "mytasks".* FROM "mytasks" WHERE "mytasks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]