app/controllers/projects_controller.rb

  def show
    @project = Project.find(params[:id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def edit
    @project = Project.find(params[:id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @project = Project.create(project_params).save
---
INSERT INTO "projects" ("name", "description", "status", "startdate", "enddate", "receive", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"  [["name", ""], ["description", ""], ["status", ""], ["startdate", ""], ["enddate", ""], ["receive", ""], ["created_at", "2017-05-24 11:43:02.507255"], ["updated_at", "2017-05-24 11:43:02.507255"]]

  def update
    @project = Project.find(params[:id])
    if @project.update(project_params)
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
UPDATE "projects" SET "name" = $1, "description" = $2, "startdate" = $3, "updated_at" = $4 WHERE "projects"."id" = $5  [["name", "Date"], ["description", "Select"], ["startdate", "{1=>2017, 2=>5, 3=>1}"], ["updated_at", "2017-05-18 09:55:04.352459"], ["id", 14]]

  def destroy
    @project = Project.find(params[:id])
    @project.destroy
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "projects" WHERE "projects"."id" = $1  [["id", 4]]